# リポジトリ
tap 'caskroom/cask'

# 必須ツール
cask 'karabiner-elements'
brew 'git'
brew 'git-lfs'
brew 'vim', args: ['with-lua', 'HEAD']
brew 'bash-completion'
brew 'direnv'
brew 'tmux'
brew 'reattach-to-user-namespace'

# PackageManager

# 便利コマンド 
brew 'hub'
brew 'wget'
brew 'nmap'
brew 'jid' #https://github.com/simeji/jid

# 言語
brew 'ruby-build'
brew 'rbenv'
cask 'java'
brew 'python' # with Pip

# ミドルウェア
brew 'mysql'

# ツール
#brew 'terraform'
brew 'tfenv'
brew 'terraform_landscape'
brew 'minamijoyo/tfschema/tfschema'
brew 'ansible'
brew 'ansible-lint'
brew 'packer'
brew 'jq'
brew 'awscli'
brew 'heroku-toolbelt'
brew 'coreutils'

