# リポジトリ
tap 'caskroom/cask'
tap 'domt4/autoupdate'

# Brew Update
brew 'terminal-notifier'

# 必須ツール
cask 'google-japanese-ime'
cask 'karabiner-elements'
brew 'git'
brew 'git-lfs'
brew 'git-secrets'
#brew 'vim', args: ['with-lua', 'HEAD']
brew 'bash-completion'
brew 'direnv'
brew 'tmux'
brew 'reattach-to-user-namespace'
#cask 'visual-studio-code'
#cask 'freeplane'
#cask 'licecap'
cask 'maczip4win'
brew 'tree'

# 便利コマンド
brew 'hub'
brew 'github/gh/gh'
brew 'wget'
brew 'nmap'
brew 'jid' #https://github.com/simeji/jid
brew 'mkcert' # localhost certification

# 言語
brew 'readline'
brew 'rbenv'
<<<<<<< HEAD
brew 'goenv'
brew 'pyenv'
brew 'nvm'
#cask 'java'
brew 'python' # with Pip
=======
cask 'java'
brew 'pyenv' # with Pip
brew 'pipenv'
>>>>>>> 380fcacedd1095727b2cc926bcb5a708046fb161

# ミドルウェア
brew 'mysql', restart_service: false, start_service: false

# ツール
#brew 'terraform'
brew 'tfenv'
brew 'terraform_landscape'
brew 'minamijoyo/tfschema/tfschema'
brew 'terraform-docs'
#brew 'ansible'
#brew 'ansible-lint'
brew 'packer'
brew 'jq'
brew 'awscli'
#brew 'heroku-toolbelt'
brew 'coreutils'
#cask 'dash'
#cask 'boostnote'
brew 'toshimaru/nyan/nyan'

# Lint
brew 'jsonlint'
brew 'watch'

# template engine
brew 'jsonnet'
